Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
        // Get the loadcell reading
        if(semaphore_updateLoadcellReading != NULL)
        {
          if(xSemaphoreTake(semaphore_updateLoadcellReading, (TickType_t)0)==pdTRUE) {
            loadcellReading = loadcellReading_global_fl32;
            xSemaphoreGive(semaphore_updateLoadcellReading);
          }
        }




        // end profiler 2, loadcell reading
        profiler_pedalUpdateTask.end(2);

        // detect loadcell outlier
        float loadcellDifferenceToLastCycle_fl32 = loadcellReading - previousLoadcellReadingInKg_fl32;
        previousLoadcellReadingInKg_fl32 = loadcellReading;
        if(!dap_calculationVariables_st.Rudder_status && !dap_calculationVariables_st.helicopterRudderStatus)
        {
          //make the force reading skip only in pedal mode
          if (fabsf(loadcellDifferenceToLastCycle_fl32) > 5.0f)
          {
            dap_calculationVariables_st.StepperPos_setback();
            dap_calculationVariables_st.reset_maxforce();
            dap_calculationVariables_st.dynamic_update();
            dap_calculationVariables_st.updateStiffness();
            // reject update when loadcell reading likely outlier
            continue;
          }
        }

        



        uint16_t angleReading_ui16 = 0;
    #ifdef ANGLE_SENSOR_GPIO
          angleReading_ui16 = analogRead(ANGLE_SENSOR_GPIO);
          // if (pos_printCount >= 100)
          // {
          //   Serial.printf("Ang.: %f\n", angleReading_ui16);
          //   pos_printCount = 0;
          // }
          // pos_printCount++;
    #endif

        // Get the angle measurement reading
        // float angleReading = loadcell->getAngleMeasurement();
      

        // start profiler 3, loadcell reading conversion
        profiler_pedalUpdateTask.start(3);

        // Invert the loadcell reading digitally if desired
        if (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.invertLoadcellReading_u8 == 1)
        {
          loadcellReading *= -1.0f;
        }

        // Convert loadcell reading to pedal force
        float sledPosition = sledPositionInMM(stepper, &dap_config_pedalUpdateTask_st, motorRevolutionsPerSteps_fl32);
        float pedalInclineAngleInDeg_fl32 = pedalInclineAngleDeg(sledPosition, &dap_config_pedalUpdateTask_st);
        float pedalForce_fl32 = convertToPedalForce(loadcellReading, sledPosition, &dap_config_pedalUpdateTask_st);
        float d_phi_d_x = convertToPedalForceGain(sledPosition, &dap_config_pedalUpdateTask_st);

        // compute gain for horizontal foot model
        float b = (float)dap_config_pedalUpdateTask_st.payLoadPedalConfig_.lengthPedal_b;
        float d = (float)dap_config_pedalUpdateTask_st.payLoadPedalConfig_.lengthPedal_d;
        float d_x_hor_d_phi = -(float)(b+d) * isin(pedalInclineAngleInDeg_fl32);
        d_x_hor_d_phi *= DEG_TO_RAD_FL32; // inner derivative

        // start profiler 3, loadcell reading conversion
        profiler_pedalUpdateTask.end(3);

        // start profiler 4, loadcell reading filtering
        profiler_pedalUpdateTask.start(4);
        
        // Do the loadcell signal filtering
        float filteredReading = 0.0f;
        float changeVelocity = 0.0f;
        float alpha_exp_filter = 1.0f - ( (float)dap_config_pedalUpdateTask_st.payLoadPedalConfig_.kf_modelNoise) / 5000.0f;
        // const velocity model denoising filter
        switch (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.kf_modelOrder) {
          case 0:
            filteredReading = kalman->filteredValue(pedalForce_fl32, 0.0f, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.kf_modelNoise);
            changeVelocity = kalman->changeVelocity();
            break;
          case 1:
            filteredReading = kalman_2nd_order->filteredValue(pedalForce_fl32, 0.0f, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.kf_modelNoise);
            changeVelocity = kalman_2nd_order->changeVelocity();
            break;
          case 2:
            filteredReading_exp_filter = filteredReading_exp_filter * alpha_exp_filter + pedalForce_fl32 * (1.0f-alpha_exp_filter);
            filteredReading = filteredReading_exp_filter;
            break;
          default:
            filteredReading = pedalForce_fl32;
            break;
        }
        //write filter reading into calculation_st
        dap_calculationVariables_st.currentForceReading=filteredReading;


        // end profiler 4, loadcell reading filtering
        profiler_pedalUpdateTask.end(4);


       
        float FilterReadingJoystick=0.0f;
        if(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.kf_Joystick_u8==1)
        {
          FilterReadingJoystick=kalman_joystick->filteredValue(filteredReading,0.0f,dap_config_pedalUpdateTask_st.payLoadPedalConfig_.kf_modelNoise_joystick);

        }
        else
        {
          FilterReadingJoystick=filteredReading;

        }


        //if filtered reading > min force, mark the servo was in aciton
        if(filteredReading > dap_config_pedalUpdateTask_st.payLoadPedalConfig_.preloadForce)
        {
          servoActionLast = millis();
        }

        // wakeup process
        if ((filteredReading > STEPPER_WAKEUP_FORCE) && (stepper->servoStatus == SERVO_IDLE_NOT_CONNECTED))
        {
          #ifdef USING_BUZZER
            Buzzer.single_beep_tone(770, 100);
            delay(300);
            Buzzer.single_beep_tone(770, 100);
          #endif
          Serial.println("Wake up servo, restart esp.");
          delay(1000);
          ESP.restart();
        }

        // pedal not in action, disable pedal power
        uint32_t pedalIdleTimout = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.servoIdleTimeout * 60 * 1000; // timeout in ms
        if ((stepper->servoStatus == SERVO_CONNECTED) && ((millis() - servoActionLast) > pedalIdleTimout) && (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.servoIdleTimeout != 0))
        {
          stepper->servoIdleAction();
          stepper->servoStatus = SERVO_IDLE_NOT_CONNECTED;
          #ifdef USING_BUZZER
            Buzzer.single_beep_tone(770, 100);
          #endif
          delay(300);
          #ifdef USING_LED
            pixels.setPixelColor(0, 0xff, 0x00, 0x00); // show red
            pixels.show();
          #endif
          #ifdef USING_BUZZER
            Buzzer.single_beep_tone(770, 100);
          #endif
          Serial.println("Servo idle timeout reached. To restart pedal, please apply pressure.");
        }
        //emergency button

        #ifdef EMERGENCY_PIN
          if ((stepper->servoStatus == SERVO_CONNECTED) && (stepper->servoStatus != SERVO_FORCE_STOP) && (digitalRead(EMERGENCY_PIN) == LOW))
          {
            stepper->servoIdleAction();
            stepper->servoStatus = SERVO_FORCE_STOP;
            #ifdef USING_BUZZER
              Buzzer.single_beep_tone(770, 100);
            #endif
            delay(300);
            #ifdef USING_LED
              pixels.setPixelColor(0, 0xff, 0x00, 0x00); // show red
              pixels.show();
            #endif
            #ifdef USING_BUZZER
              Buzzer.single_beep_tone(770, 100);
            #endif
            Serial.println("Servo force Stoped.");
          }
        #endif
        //float FilterReadingJoystick=averagefilter_joystick.process(filteredReading);


        // start profiler 4, movement strategy
        profiler_pedalUpdateTask.start(5);


