Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
        // print profiler results
        // profiler_pedalUpdateTask.report();
      
      }
    }

    taskYIELD();
  }
}

  






/**********************************************************************************************/
/*                                                                                            */
/*                         joystick output task                                               */
/*                                                                                            */
/**********************************************************************************************/
void IRAM_ATTR_FLAG joystickOutputTask( void * pvParameters )
{ 
  int32_t joystickNormalizedToInt32_local = 0;

  FunctionProfiler profiler_joystickOutputTask;
  profiler_joystickOutputTask.setName("JoystickOutput");
  profiler_joystickOutputTask.setNumberOfCalls(500);


  for(;;){

    // wait for the timer to fire
    // This will block until the timer callback gives the semaphore. It won't consume CPU time while waiting.
    // if(handle_joystickOutput != NULL)
    {
      if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) {

        // copy global struct to local for faster and safe executiion
        DAP_config_st jut_dap_config_st = global_dap_config_class.getConfig();

        // activate profiler depending on pedal config
        if (jut_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
        {
          profiler_joystickOutputTask.activate( true );
        }
        else
        {
          profiler_joystickOutputTask.activate( false );
        }

        // start profiler 0, overall function
        profiler_joystickOutputTask.start(0);


        // obtain joystick output level
        if(semaphore_updateJoystick!=NULL)
        {
          if(xSemaphoreTake(semaphore_updateJoystick, (TickType_t)1)==pdTRUE)
          {
            //Serial.print(" 3");
            joystickNormalizedToInt32_local = joystickNormalizedToInt32;
            xSemaphoreGive(semaphore_updateJoystick);
          }
        }


        // send joystick output
        #if defined(USB_JOYSTICK) || defined(BLUETOOTH_GAMEPAD)
          if (IsControllerReady()) 
          {
            if(dap_calculationVariables_st.Rudder_status==false)
            {
              //general output
              SetControllerOutputValue(joystickNormalizedToInt32_local);
              
              #ifdef USB_JOYSTICK
                // Restart HID output if faulty behavior was detected
                JoystickSendState();
                if(!GetJoystickStatus())
                {
                  RestartJoystick();
                  Serial.println("HID Error, Restart Joystick...");
                  //last_serial_joy_out=millis();
                }
              #endif

            }
          }
        #endif


        // start profiler 0, overall function
        profiler_joystickOutputTask.end(0);

        profiler_joystickOutputTask.end(0);

        // print profiler results
        profiler_joystickOutputTask.report();


        // force a context switch
		    taskYIELD();

      }
    }
  }
}

/**********************************************************************************************/
/*                                                                                            */
/*                         communication task                                                 */
/*                                                                                            */
/**********************************************************************************************/

typedef struct {
    uint16_t startBytePos_u16;
    uint16_t endBytePos_u16;
    uint16_t payloadType_u16;
    bool validFlag_b;
} structChecker_st;

// Helper function to determine expected packet size from payload type
// Returns 0 if the payload type is unknown.
static inline size_t getExpectedPacketSize(uint8_t payloadType) {
    switch (payloadType) {
        case DAP_PAYLOAD_TYPE_CONFIG:
            return sizeof(DAP_config_st);
        case DAP_PAYLOAD_TYPE_ACTION:
            return sizeof(DAP_actions_st);
        // Add other packet types here in the future
        default:
            return 0;
    }
}

// NOTE: The IRAM_ATTR attribute has been removed as it is not needed for a FreeRTOS task function.
void serialCommunicationTaskRx(void *pvParameters) {
    FunctionProfiler profiler_serialCommunicationTask;
    profiler_serialCommunicationTask.setName("SerialCommunicationRx");
    profiler_serialCommunicationTask.setNumberOfCalls(500);

    static DAP_config_st sct_dap_config_st;

    // Buffer to accumulate incoming serial data
    const size_t RX_BUFFER_SIZE = 1028; // Should be at least 2x the largest possible packet
    static uint8_t rx_buffer[RX_BUFFER_SIZE];
    static size_t buffer_len = 0;

    for (;;) {
        // Wait for a notification that data might be available
        if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) {
            
            sct_dap_config_st = global_dap_config_class.getConfig();
            // Activate profiler based on config
            profiler_serialCommunicationTask.activate(sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER);
            profiler_serialCommunicationTask.start(0);

            // --- 1. Read all available data into our buffer ---
            if (Serial.available()) {
                // Prevent buffer overflow by only reading what fits
                size_t bytesToRead = min((size_t)Serial.available(), RX_BUFFER_SIZE - buffer_len);
                if (bytesToRead > 0) {
                    Serial.readBytes(&rx_buffer[buffer_len], bytesToRead);
                    buffer_len += bytesToRead;
                }
            }

            // --- 2. Process all complete packets in the buffer ---
            size_t buffer_idx = 0;
            while (buffer_idx < buffer_len) {
                // A. Find the next valid Start-of-Frame (SOF)
                if (rx_buffer[buffer_idx] != SOF_BYTE_0 || (buffer_idx + 1 < buffer_len && rx_buffer[buffer_idx + 1] != SOF_BYTE_1)) {
                    buffer_idx++;
                    continue; // Keep scanning for a SOF
                }

                // SOF found at buffer_idx. Check if we have enough data for a header.
                if (buffer_len < buffer_idx + 3) {
                    // Not enough data for a full header, stop parsing for now
                    break;
                }

                // B. Get expected packet size from payload type
                uint8_t payloadType = rx_buffer[buffer_idx + 2];
                size_t expectedSize = getExpectedPacketSize(payloadType);

