Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
                            }
                            
                            // trigger system identification
                            if (received_action.payloadPedalAction_.startSystemIdentification_u8)
                            {
                              systemIdentificationMode_b = true;
                            }
                            // trigger Custom effect effect 1
                            if (received_action.payloadPedalAction_.Trigger_CV_1)
                            {
                              CV1.trigger();
                            }
                            // trigger Custom effect effect 2
                            if (received_action.payloadPedalAction_.Trigger_CV_2)
                            {
                              CV2.trigger();
                            }
                            // trigger return pedal position
                            if (received_action.payloadPedalAction_.returnPedalConfig_u8)
                            {
                            
                              DAP_config_st * dap_config_st_local_ptr;
                              dap_config_st_local_ptr = &sct_dap_config_st;
                              dap_config_st_local_ptr->payLoadHeader_.startOfFrame0_u8 = SOF_BYTE_0;
                              dap_config_st_local_ptr->payLoadHeader_.startOfFrame1_u8 = SOF_BYTE_1;
                              dap_config_st_local_ptr->payloadFooter_.enfOfFrame0_u8 = EOF_BYTE_0;
                              dap_config_st_local_ptr->payloadFooter_.enfOfFrame1_u8 = EOF_BYTE_1;
                              uint16_t crc = checksumCalculator((uint8_t*)(&(sct_dap_config_st.payLoadHeader_)), sizeof(sct_dap_config_st.payLoadHeader_) + sizeof(sct_dap_config_st.payLoadPedalConfig_));
                              dap_config_st_local_ptr->payloadFooter_.checkSum = crc;
                              Serial.write((char*)dap_config_st_local_ptr, sizeof(DAP_config_st));
                              // Serial.print("\r\n");
                            }
                            #ifdef ESPNOW_Enable
                              if(received_action.payloadPedalAction_.Rudder_action==1)//Enable Rudder
                              {
                                if(dap_calculationVariables_st.Rudder_status==false)
                                {
                                  dap_calculationVariables_st.Rudder_status=true;
                                  Serial.println("Rudder on");
                                  Rudder_initializing=true;
                                  moveSlowlyToPosition_b=true;
                                  //Serial.print("status:");
                                  //Serial.println(dap_calculationVariables_st.Rudder_status);
                                }
                                else
                                {
                                  dap_calculationVariables_st.Rudder_status=false;
                                  Serial.println("Rudder off");
                                  Rudder_deinitializing=true;
                                  moveSlowlyToPosition_b=true; 

                                  //Serial.print("status:");
                                  //Serial.println(dap_calculationVariables_st.Rudder_status);
                                }
                              }
                              if(received_action.payloadPedalAction_.Rudder_brake_action==1)
                              {
                                if(dap_calculationVariables_st.rudder_brake_status==false&&dap_calculationVariables_st.Rudder_status==true)
                                {
                                  dap_calculationVariables_st.rudder_brake_status=true;
                                  Serial.println("Rudder brake on");
                                  //Serial.print("status:");
                                  //Serial.println(dap_calculationVariables_st.Rudder_status);
                                }
                                else
                                {
                                  dap_calculationVariables_st.rudder_brake_status=false;
                                  Serial.println("Rudder brake off");
                                  //Serial.print("status:");
                                  //Serial.println(dap_calculationVariables_st.Rudder_status);
                                }
                              }
                              //clear rudder status
                              if(received_action.payloadPedalAction_.Rudder_action==2)
                              {
                                dap_calculationVariables_st.Rudder_status=false;
                                dap_calculationVariables_st.rudder_brake_status=false;
                                Serial.println("Rudder Status Clear");
                                Rudder_deinitializing=true;
                                moveSlowlyToPosition_b=true;

                              }
                            #endif
                            
                            

                            
                        }
                        break;
                    }

                    
                } // end switch

                if (!structIsValid) {
                    Serial.printf("Invalid packet detected (Type: %d). Skipping SOF.\n", payloadType);
                    buffer_idx++; // Skip the failed SOF and continue scanning
                } else {
                    // Packet was valid and processed, advance index past this packet
                    buffer_idx += expectedSize;
                }
            } // end while

            // --- 3. Clean up the buffer ---
            if (buffer_idx > 0) {
                size_t remaining_len = buffer_len - buffer_idx;
                if (remaining_len > 0) {
                    memmove(rx_buffer, &rx_buffer[buffer_idx], remaining_len);
                }
                buffer_len = remaining_len;
            }

            profiler_serialCommunicationTask.end(0);
            profiler_serialCommunicationTask.report();
        } // end if TaskNotifyTake
    } // end for(;;)
}



uint32_t communicationTask_stackSizeIdx_u32 = 0;
void IRAM_ATTR_FLAG serialCommunicationTaskTx( void * pvParameters )
{ 
  FunctionProfiler profiler_serialCommunicationTask;
  profiler_serialCommunicationTask.setName("SerialCommunicationTx");
  profiler_serialCommunicationTask.setNumberOfCalls(500);

