Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
  unsigned long previousTimeInUsFromExtendedStruct_u32 = 0;
  unsigned long printCycleCounter = 0;

  static uint16_t timerTicks_serialCommunicationTask_u16 = REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US / BASE_TICK_US;
  static uint16_t timerTicks_serialCommunicationTask_prev_u16 = timerTicks_serialCommunicationTask_u16;

  static DAP_config_st sct_dap_config_received_st;
  static DAP_config_st sct_dap_config_st;
  for(;;){

    sct_dap_config_st = global_dap_config_class.getConfig();

    // when debug flag == DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT is set --> change the serial communication task time
    if ( (sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT) )
    {
      // fast execution
      timerTicks_serialCommunicationTask_u16 = REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_FAST_IN_US / BASE_TICK_US;
    }
    else
    {
      // slow execution
      timerTicks_serialCommunicationTask_u16 = REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US / BASE_TICK_US;   
    }


    // check if timer intervall needs to change
    if (timerTicks_serialCommunicationTask_prev_u16 != timerTicks_serialCommunicationTask_u16)
    {
      // update previous value
      timerTicks_serialCommunicationTask_prev_u16 = timerTicks_serialCommunicationTask_u16;

      Serial.print("Setting serial communication task to: ");
      Serial.print(timerTicks_serialCommunicationTask_u16 * BASE_TICK_US);
      Serial.println("us");

      for ( uint8_t taskIdx_u8 = 0; taskIdx_u8<taskCount; taskIdx_u8++)
      {
        if (tasks[taskIdx_u8].name != nullptr && strcmp(tasks[taskIdx_u8].name, "serComTx") == 0)
        {
          Serial.println("serComTx found");
          tasks[taskIdx_u8].intervalTicks = timerTicks_serialCommunicationTask_u16; // hard coded serial Tx task handle
          tasks[taskIdx_u8].counter = 0;  // reset counter
        }
      }
      
    }


	  if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) {
	
      // activate profiler depending on pedal config
      if (sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
      {
        profiler_serialCommunicationTask.activate( true );
      }
      else
      {
        profiler_serialCommunicationTask.activate( false );
      }
	
	
      // start profiler 0, overall function
      profiler_serialCommunicationTask.start(0);



      // start profiler 2, serial send
      profiler_serialCommunicationTask.start(1);


      // send pedal state structs
      // update pedal states
      printCycleCounter++;
      DAP_state_basic_st dap_state_basic_st_lcl;
      DAP_state_extended_st dap_state_extended_st_lcl;
      
      // initialize with zeros in case semaphore couldn't be aquired
      // memset(&dap_state_basic_st_lcl, 0, sizeof(dap_state_basic_st_lcl));
      // memset(&dap_state_extended_st_lcl, 0, sizeof(dap_state_extended_st_lcl));


      if(semaphore_updatePedalStates!=NULL)
      {
        if(xSemaphoreTake(semaphore_updatePedalStates, (TickType_t)5)==pdTRUE) 
        {
        
          // UPDATE basic pedal state struct
          dap_state_basic_st_lcl = dap_state_basic_st;

          // UPDATE extended pedal state struct
          dap_state_extended_st_lcl = dap_state_extended_st;
          
          // release semaphore
          xSemaphoreGive(semaphore_updatePedalStates);

        }
      }

          
      // end profiler 2, serial send
      profiler_serialCommunicationTask.end(1);

      // end profiler 2, serial send
      profiler_serialCommunicationTask.start(2);


      // send the pedal state structs
      // send basic pedal state struct
      if ( !(sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_STATE_BASIC_INFO_STRUCT) )
      {
        if (printCycleCounter >= 2)
        {
          printCycleCounter = 0;

          // update CRC before transmission
          dap_state_basic_st_lcl.payloadFooter_.checkSum = checksumCalculator((uint8_t*)(&(dap_state_basic_st_lcl.payLoadHeader_)), sizeof(dap_state_basic_st_lcl.payLoadHeader_) + sizeof(dap_state_basic_st_lcl.payloadPedalState_Basic_));
        
          Serial.write((char*)&dap_state_basic_st_lcl, sizeof(DAP_state_basic_st));
          // Serial.flush();
        
          // Serial.print("\r\n");
        }
      }

      if ( (sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT) )
      {
        // only send, when extended struct contains updated values
        if( dap_state_extended_st_lcl.payloadPedalState_Extended_.timeInUs_u32 != previousTimeInUsFromExtendedStruct_u32)
        {
          previousTimeInUsFromExtendedStruct_u32 = dap_state_extended_st_lcl.payloadPedalState_Extended_.timeInUs_u32;

          //dap_state_extended_st_lcl.payloadPedalState_Extended_.timeInUsFromSerialTask_u32 = micros();

          // update CRC before transmission
          dap_state_extended_st_lcl.payloadFooter_.checkSum = checksumCalculator((uint8_t*)(&(dap_state_extended_st_lcl.payLoadHeader_)), sizeof(dap_state_extended_st_lcl.payLoadHeader_) + sizeof(dap_state_extended_st_lcl.payloadPedalState_Extended_));

          Serial.write((char*)&dap_state_extended_st_lcl, sizeof(DAP_state_extended_st));
          // Serial.print("\r\n");
          // Serial.flush();
        }
      }

      // end profiler 3, serial send
      profiler_serialCommunicationTask.end(2);

      profiler_serialCommunicationTask.end(0);

      // print profiler results
      profiler_serialCommunicationTask.report();
      

      // force a context switch
      taskYIELD();
    }
  }
}

//OTA multitask
bool OTA_enable_start=false;
void OTATask( void * pvParameters )
{
  uint16_t OTA_count=0;
  bool message_out_b=false;
  int OTA_update_status=99;

  for(;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) {

      if(OTA_count>200)
      {
        message_out_b=true;
        OTA_count=0;
      }
      else
      {
        OTA_count++;
      }

      #if defined(OTA_update)  || defined(OTA_update_ESP32)
      if(OTA_enable_b)
      {
        if(message_out_b)
        {
          message_out_b=false;
          Serial1.println("OTA enable flag on");
        }
        if(OTA_status)
        {
          #ifdef OTA_update_ESP32
            server.handleClient();
          #endif
          #ifdef OTA_update
            if(OTA_update_status==0)
            {
              #ifdef USING_BUZZER
                Buzzer.play_melody_tone(melody_victory_theme, sizeof(melody_victory_theme)/sizeof(melody_victory_theme[0]),melody_durations_Victory_theme);              
              #endif
              ESP.restart();
            }
            else
            {
              #ifdef USING_BUZZER
                Buzzer.single_beep_tone(770,100);
              #endif
              #ifdef USING_LED
              pixels.setPixelColor(0,0xff,0x00,0x00);//red
              pixels.show(); 
              delay(500);
              pixels.setPixelColor(0,0x00,0x00,0x00);//no color
              pixels.show();
              delay(500);    
              #endif 
            }

          #endif
          

