Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
        }
        else
        {
          Serial.println("de-initialize espnow");
          Serial.println("wait...");
          #ifdef ESPNOW_Enable
            esp_err_t result= esp_now_deinit();
            ESPNow_initial_status=false;
            ESPNOW_status=false;
          #else
            esp_err_t result = ESP_OK;
          #endif
          delay(3000);
          if(result==ESP_OK)
          {
            OTA_status=true;
            #ifdef USING_BUZZER
              Buzzer.single_beep_tone(700,100);
            #endif 
            delay(1000);
            #ifdef OTA_update_ESP32
            ota_wifi_initialize(APhost);
            #endif
            #ifdef USING_LED
                //pixels.setBrightness(20);
                pixels.setPixelColor(0,0x00,0x00,0xff);//Blue
                pixels.show(); 
                //delay(3000);
            #endif
            #ifdef OTA_update
            wifi_initialized(SSID,PASS);
            delay(2000);
            ESP32OTAPull ota;
            int ret;
            ota.SetCallback(OTAcallback);
            ota.OverrideBoard(CONTROL_BOARD);
            char* version_tag;
            if(_dap_OtaWifiInfo_st.wifi_action==1)
            {
              const char* str;
              if(PCB_VERSION==3||PCB_VERSION==5||PCB_VERSION==9) str ="0.90.16";// for those board which change the partition table
              else str ="0.0.0";
              version_tag=new char[strlen(str) + 1];
              strcpy(version_tag, str);
              Serial.println("Force update");
            }
            else
            {
              version_tag=new char[strlen(DAP_FIRMWARE_VERSION) + 1];
              strcpy(version_tag, DAP_FIRMWARE_VERSION);
              //version_tag=DAP_FIRMWARE_VERSION;
            }
            switch (_dap_OtaWifiInfo_st.mode_select)
            {
              case 1:
                Serial.printf("Flashing to latest release, checking %s to see if an update is available...\n", OTA_JSON_URL_MAIN);
                ret = ota.CheckForOTAUpdate(OTA_JSON_URL_MAIN, version_tag, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
                Serial.printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                OTA_update_status=ret;
                break;
              case 2:
                Serial.printf("Flashing to latest dev build, checking %s to see if an update is available...\n", OTA_JSON_URL_DEV);
                ret = ota.CheckForOTAUpdate(OTA_JSON_URL_DEV, version_tag, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
                Serial.printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                OTA_update_status=ret;
                break;
              case 3:
                Serial.printf("Flashing to test build, checking %s to see if an update is available...\n", OTA_JSON_URL_TEST);
                ret = ota.CheckForOTAUpdate(OTA_JSON_URL_TEST, version_tag, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
                Serial.printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                OTA_update_status=ret;
                break;
              default:
              break;
              delete[] version_tag; 
            }
            #endif

            delay(3000);
          }

        }
      }
      
      #endif
    }

    // force a context switch
		taskYIELD();
  }
}

#ifdef ESPNOW_Enable

void IRAM_ATTR_FLAG ESPNOW_SyncTask( void * pvParameters )
{
  FunctionProfiler profiler_espNow;
  profiler_espNow.setName("EspNow");

  uint Pairing_timeout=20000;
  uint rudderPacketInterval=3;
  uint joystickPacketInterval=3;
  uint basicStateUpdateInterval=3;
  uint extendStateUpdateInterval=10;
  bool Pairing_timeout_status=false;
  bool building_dap_esppairing_lcl =false;
  unsigned long Pairing_state_start;
  unsigned long Pairing_state_last_sending;
  unsigned long Debug_rudder_last=0;
  unsigned long basic_state_update_last=0;
  unsigned long extend_state_update_last=0;
  unsigned long rudderPacketsUpdateLast=0;
  unsigned long joystickPacketsUpdateLast=0;
  uint32_t espNowTask_stackSizeIdx_u32 = 0;

  int error_count=0;
  int print_count=0;
  int ESPNow_no_device_count=0;
  bool basic_state_send_b=false;
  bool extend_state_send_b=false;
  uint8_t error_out;

  for(;;)
  {
      if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) {

        //restart from espnow
        if(ESPNow_restart)
        {
          Serial.println("ESP restart by ESP now request");
          ESP.restart();
        }

        
        //basic state sendout interval
        if(millis()-basic_state_update_last>basicStateUpdateInterval)
        {
          basic_state_send_b=true;
          basic_state_update_last=millis();
          
        }

        DAP_config_st espnow_dap_config_st = global_dap_config_class.getConfig();

        //entend state send out interval
        if((millis()-extend_state_update_last>extendStateUpdateInterval) && espnow_dap_config_st.payLoadPedalConfig_.debug_flags_0 == DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT)
        {
          extend_state_send_b=true;
          extend_state_update_last=millis();
          
        }

        // activate profiler depending on pedal config
        if (espnow_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
        {
          profiler_espNow.activate( true );
        }
        else
        {
          profiler_espNow.activate( false );
        }

        // start profiler 0, overall function
        profiler_espNow.start(0);

        
        if(ESPNow_initial_status==false  )
        {
          if(OTA_enable_b==false)
          {
            ESPNow_initialize();
          }
          
        }
        else
        {
          #ifdef ESPNow_Pairing_function
          #ifdef Hardware_Pairing_button
            if(digitalRead(Pairing_GPIO)==LOW)
            {
              hardware_pairing_action_b=true;
            }
          #endif
            if(hardware_pairing_action_b||software_pairing_action_b)
            {
              Serial.println("Pedal Pairing.....");
              delay(1000);
              Pairing_state_start=millis();
              Pairing_state_last_sending=millis();
              ESPNow_pairing_action_b=true;
              building_dap_esppairing_lcl=true;
              software_pairing_action_b=false;
              hardware_pairing_action_b=false;
              
