Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
            }
            if(ESPNow_pairing_action_b)
            {
              unsigned long now=millis();
              //sending package
              if(building_dap_esppairing_lcl)
              {
                uint16_t crc=0;          
                building_dap_esppairing_lcl=false;
                dap_esppairing_lcl.payloadESPNowInfo_._deviceID = espnow_dap_config_st.payLoadPedalConfig_.pedal_type;
                dap_esppairing_lcl.payLoadHeader_.payloadType = DAP_PAYLOAD_TYPE_ESPNOW_PAIRING;
                dap_esppairing_lcl.payLoadHeader_.PedalTag = espnow_dap_config_st.payLoadPedalConfig_.pedal_type;
                dap_esppairing_lcl.payLoadHeader_.version = DAP_VERSION_CONFIG;
                crc = checksumCalculator((uint8_t*)(&(dap_esppairing_lcl.payLoadHeader_)), sizeof(dap_esppairing_lcl.payLoadHeader_) + sizeof(dap_esppairing_lcl.payloadESPNowInfo_));
                dap_esppairing_lcl.payloadFooter_.checkSum=crc;
              }
              if(now-Pairing_state_last_sending>400)
              {
                Pairing_state_last_sending=now;
                ESPNow.send_message(broadcast_mac,(uint8_t *) &dap_esppairing_lcl, sizeof(dap_esppairing_lcl));
              }

              

              //timeout check
              if(now-Pairing_state_start>Pairing_timeout)
              {
                ESPNow_pairing_action_b=false;
                Serial.print("Pedal: ");
                Serial.print(espnow_dap_config_st.payLoadPedalConfig_.pedal_type);
                Serial.println(" timeout.");
                #ifdef USING_BUZZER
                  Buzzer.single_beep_tone(700,100);
                #endif 
                if(UpdatePairingToEeprom)
                {
                  EEPROM.put(EEPROM_offset,_ESP_pairing_reg);
                  EEPROM.commit();
                  UpdatePairingToEeprom=false;
                  //list eeprom
                  ESP_pairing_reg ESP_pairing_reg_local;
                  EEPROM.get(EEPROM_offset, ESP_pairing_reg_local);
                  for(int i=0;i<4;i++)
                  {
                    if(ESP_pairing_reg_local.Pair_status[i]==1)
                    {
                      Serial.print("#");
                      Serial.print(i);
                      Serial.print("Pair: ");
                      Serial.print(ESP_pairing_reg_local.Pair_status[i]);
                      Serial.printf(" Mac: %02X:%02X:%02X:%02X:%02X:%02X\n", ESP_pairing_reg_local.Pair_mac[i][0], ESP_pairing_reg_local.Pair_mac[i][1], ESP_pairing_reg_local.Pair_mac[i][2], ESP_pairing_reg_local.Pair_mac[i][3], ESP_pairing_reg_local.Pair_mac[i][4], ESP_pairing_reg_local.Pair_mac[i][5]);
                    }
                  }
                  //adding peer
                  
                  for(int i=0; i<4;i++)
                  {
                    if(_ESP_pairing_reg.Pair_status[i]==1)
                    {
                      if(i==0)
                      {
                        ESPNow.remove_peer(Clu_mac);
                        memcpy(&Clu_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                        delay(100);
                        ESPNow.add_peer(Clu_mac);
                        
                      }
                      if(i==1)
                      {
                        ESPNow.remove_peer(Brk_mac);
                        memcpy(&Brk_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                        delay(100);
                        ESPNow.add_peer(Brk_mac);
                      }
                      if(i==2)
                      {
                        ESPNow.remove_peer(Gas_mac);
                        memcpy(&Gas_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                        delay(100);
                        ESPNow.add_peer(Gas_mac);
                      }        
                      if(i==3)
                      {
                        ESPNow.remove_peer(esp_Host);
                        memcpy(&esp_Host,&_ESP_pairing_reg.Pair_mac[i],6);
                        delay(100);
                        ESPNow.add_peer(esp_Host);                
                      }        
                      if(espnow_dap_config_st.payLoadPedalConfig_.pedal_type==1)
                      {
                        Recv_mac=Gas_mac;
                      }
                      if(espnow_dap_config_st.payLoadPedalConfig_.pedal_type==2)
                      {
                        Recv_mac=Brk_mac;
                      }
                    }
                  }
                }
              }
            }
          #endif

          profiler_espNow.start(1);

          //joystick value broadcast
          /*
          if((joystickPacketsUpdateLast-millis())>joystickPacketInterval) 
          {
            ESPNow_Joystick_Broadcast(joystickNormalizedToInt32);
            joystickPacketsUpdateLast=millis();
          }
          */
          
          profiler_espNow.end(1);

          profiler_espNow.start(2);

          if(basic_state_send_b)
          {
            // update pedal states
            DAP_state_basic_st dap_state_basic_st_lcl;       
            // initialize with zeros in case semaphore couldn't be aquired
            memset(&dap_state_basic_st_lcl, 0, sizeof(dap_state_basic_st_lcl));
            if(semaphore_updatePedalStates!=NULL)
            {  
              if(xSemaphoreTake(semaphore_updatePedalStates, (TickType_t)5)==pdTRUE) 
              {
                // UPDATE basic pedal state struct
                dap_state_basic_st_lcl = dap_state_basic_st;

                // release semaphore
                xSemaphoreGive(semaphore_updatePedalStates);
                dap_state_basic_st_lcl.payloadFooter_.checkSum = checksumCalculator((uint8_t*)(&(dap_state_basic_st_lcl.payLoadHeader_)), sizeof(dap_state_basic_st_lcl.payLoadHeader_) + sizeof(dap_state_basic_st_lcl.payloadPedalState_Basic_));
              }
            }
            else
            {
              semaphore_updatePedalStates = xSemaphoreCreateMutex();
            }
            ESPNow.send_message(broadcast_mac,(uint8_t *) & dap_state_basic_st_lcl,sizeof(dap_state_basic_st_lcl));
            basic_state_send_b=false;
          }

          profiler_espNow.end(2);

          profiler_espNow.start(3);

          if(extend_state_send_b)
          {
            // update pedal states
            DAP_state_extended_st dap_state_extended_st_espNow; 
            // initialize with zeros in case semaphore couldn't be aquired
            memset(&dap_state_extended_st_espNow, 0, sizeof(dap_state_extended_st_espNow));
            if(semaphore_updatePedalStates!=NULL)
            {  
              if(xSemaphoreTake(semaphore_updatePedalStates, (TickType_t)5)==pdTRUE) 
              {
                // UPDATE extended pedal state struct
                dap_state_extended_st_espNow = dap_state_extended_st; 
                // release semaphore
                xSemaphoreGive(semaphore_updatePedalStates);
                dap_state_extended_st_espNow.payloadFooter_.checkSum = checksumCalculator((uint8_t*)(&(dap_state_extended_st_espNow.payLoadHeader_)), sizeof(dap_state_extended_st_espNow.payLoadHeader_) + sizeof(dap_state_extended_st_espNow.payloadPedalState_Extended_));
              }
            }
            else
            {
              semaphore_updatePedalStates = xSemaphoreCreateMutex();
            }

            ESPNow.send_message(broadcast_mac,(uint8_t *)&dap_state_extended_st_espNow, sizeof(dap_state_extended_st_espNow));
            extend_state_send_b=false;
          }

          profiler_espNow.end(3);


          if(ESPNow_config_request)
          {
            DAP_config_st * dap_config_st_local_ptr;
            dap_config_st_local_ptr = &espnow_dap_config_st;
            dap_config_st_local_ptr->payLoadHeader_.startOfFrame0_u8 = SOF_BYTE_0;
            dap_config_st_local_ptr->payLoadHeader_.startOfFrame1_u8 = SOF_BYTE_1;
            dap_config_st_local_ptr->payloadFooter_.enfOfFrame0_u8 = EOF_BYTE_0;
            dap_config_st_local_ptr->payloadFooter_.enfOfFrame1_u8 = EOF_BYTE_1;
            uint16_t crc=0;
            crc = checksumCalculator((uint8_t*)(&(espnow_dap_config_st.payLoadHeader_)), sizeof(espnow_dap_config_st.payLoadHeader_) + sizeof(espnow_dap_config_st.payLoadPedalConfig_));
            dap_config_st_local_ptr->payloadFooter_.checkSum = crc;
            ESPNow.send_message(broadcast_mac,(uint8_t *) & espnow_dap_config_st, sizeof(espnow_dap_config_st));
            ESPNow_config_request=false;
          }


          if(ESPNow_OTA_enable)
          {
            Serial.println("Get OTA command");
            
            OTA_enable_b=true;
            OTA_enable_start=true;
            ESPNow_OTA_enable=false;
          }


          if(OTA_update_action_b)
          {
            Serial.println("Get OTA command");
            #ifdef USING_BUZZER
              buzzerBeepAction_b=true;
            #endif
            OTA_enable_b=true;
            OTA_enable_start=true;
            ESPNow_OTA_enable=false;
            Serial.println("get basic wifi info");
            Serial.readBytes((char*)&_dap_OtaWifiInfo_st, sizeof(DAP_otaWifiInfo_st));
            #ifdef OTA_update
              if(_dap_OtaWifiInfo_st.device_ID == espnow_dap_config_st.payLoadPedalConfig_.pedal_type)
              {
                SSID=new char[_dap_OtaWifiInfo_st.SSID_Length+1];
                PASS=new char[_dap_OtaWifiInfo_st.PASS_Length+1];
                memcpy(SSID,_dap_OtaWifiInfo_st.WIFI_SSID,_dap_OtaWifiInfo_st.SSID_Length);
                memcpy(PASS,_dap_OtaWifiInfo_st.WIFI_PASS,_dap_OtaWifiInfo_st.PASS_Length);
                SSID[_dap_OtaWifiInfo_st.SSID_Length]=0;
                PASS[_dap_OtaWifiInfo_st.PASS_Length]=0;
                OTA_enable_b=true;
              }
            #endif

